## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 84 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         RESOURCE                                         |
|--------|------------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.n8n`                                                                |
|        | `aws_acm_certificate_validation.n8n`                                                     |
|        | `aws_efs_access_point.n8n`                                                               |
|        | `aws_efs_backup_policy.n8n`                                                              |
|        | `aws_efs_file_system.n8n`                                                                |
|        | `aws_efs_file_system_policy.n8n`                                                         |
|        | `aws_efs_mount_target.n8n[0]`                                                            |
|        | `aws_efs_mount_target.n8n[1]`                                                            |
|        | `aws_lb.n8n`                                                                             |
|        | `aws_lb_listener.n8n`                                                                    |
|        | `aws_lb_target_group.n8n`                                                                |
|        | `aws_route53_record.n8n_A`                                                               |
|        | `aws_route53_record.n8n_validation[&quot;*.n8n.cdssandbox.xyz&quot;]`                              |
|        | `aws_route53_record.n8n_validation[&quot;n8n.cdssandbox.xyz&quot;]`                                |
|        | `aws_security_group.n8n_ecs`                                                             |
|        | `aws_security_group.n8n_efs`                                                             |
|        | `aws_security_group.n8n_lb`                                                              |
|        | `aws_security_group_rule.n8n_ecs_egress_all`                                             |
|        | `aws_security_group_rule.n8n_ecs_ingress_lb`                                             |
|        | `aws_security_group_rule.n8n_efs_ingress_ecs`                                            |
|        | `aws_security_group_rule.n8n_lb_egress_ecs`                                              |
|        | `aws_security_group_rule.n8n_lb_ingress_internet_https`                                  |
|        | `aws_ssm_parameter.n8n_encryption_key`                                                   |
|        | `aws_wafv2_rule_group.rate_limiters_group`                                               |
|        | `aws_wafv2_web_acl.n8n`                                                                  |
|        | `aws_wafv2_web_acl_association.n8n`                                                      |
|        | `random_string.alb_tg_suffix`                                                            |
|        | `module.ecs_shutdown.aws_cloudwatch_event_rule.schedule[&quot;shutdown&quot;]`                     |
|        | `module.ecs_shutdown.aws_cloudwatch_event_rule.schedule[&quot;startup&quot;]`                      |
|        | `module.ecs_shutdown.aws_cloudwatch_event_target.schedule[&quot;shutdown&quot;]`                   |
|        | `module.ecs_shutdown.aws_cloudwatch_event_target.schedule[&quot;startup&quot;]`                    |
|        | `module.ecs_shutdown.aws_cloudwatch_log_group.schedule`                                  |
|        | `module.ecs_shutdown.aws_iam_policy.schedule`                                            |
|        | `module.ecs_shutdown.aws_iam_role.schedule`                                              |
|        | `module.ecs_shutdown.aws_iam_role_policy_attachment.schedule`                            |
|        | `module.ecs_shutdown.aws_lambda_function.schedule`                                       |
|        | `module.ecs_shutdown.aws_lambda_permission.schedule[&quot;shutdown&quot;]`                         |
|        | `module.ecs_shutdown.aws_lambda_permission.schedule[&quot;startup&quot;]`                          |
|        | `module.n8n_ecs.aws_cloudwatch_log_group.this`                                           |
|        | `module.n8n_ecs.aws_ecs_cluster.this[0]`                                                 |
|        | `module.n8n_ecs.aws_ecs_cluster_capacity_providers.this[0]`                              |
|        | `module.n8n_ecs.aws_ecs_service.this`                                                    |
|        | `module.n8n_ecs.aws_ecs_task_definition.this`                                            |
|        | `module.n8n_ecs.aws_iam_policy.this_task[0]`                                             |
|        | `module.n8n_ecs.aws_iam_policy.this_task_exec`                                           |
|        | `module.n8n_ecs.aws_iam_role.this_task`                                                  |
|        | `module.n8n_ecs.aws_iam_role.this_task_exec`                                             |
|        | `module.n8n_ecs.aws_iam_role_policy_attachment.this_task[0]`                             |
|        | `module.n8n_ecs.aws_iam_role_policy_attachment.this_task_exec`                           |
|        | `module.vpc.aws_cloudwatch_log_group.flow_logs[0]`                                       |
|        | `module.vpc.aws_default_network_acl.default`                                             |
|        | `module.vpc.aws_default_route_table.default`                                             |
|        | `module.vpc.aws_default_security_group.default`                                          |
|        | `module.vpc.aws_eip.nat[0]`                                                              |
|        | `module.vpc.aws_flow_log.flow_logs[0]`                                                   |
|        | `module.vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0]`                        |
|        | `module.vpc.aws_iam_role.flow_logs[0]`                                                   |
|        | `module.vpc.aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write_policy_attach[0]` |
|        | `module.vpc.aws_internet_gateway.gw`                                                     |
|        | `module.vpc.aws_nat_gateway.nat_gw[0]`                                                   |
|        | `module.vpc.aws_network_acl.main`                                                        |
|        | `module.vpc.aws_network_acl_rule.block_rdp[0]`                                           |
|        | `module.vpc.aws_network_acl_rule.block_ssh[0]`                                           |
|        | `module.vpc.aws_network_acl_rule.https_request_egress_443[0]`                            |
|        | `module.vpc.aws_network_acl_rule.https_request_in_ingress_443[0]`                        |
|        | `module.vpc.aws_network_acl_rule.https_request_in_ingress_ephemeral[0]`                  |
|        | `module.vpc.aws_network_acl_rule.https_request_in_response_egress_443[0]`                |
|        | `module.vpc.aws_network_acl_rule.https_request_in_response_egress_ephemeral[0]`          |
|        | `module.vpc.aws_network_acl_rule.https_request_out_egress_ephemeral[0]`                  |
|        | `module.vpc.aws_network_acl_rule.https_request_out_response_ingress_443[0]`              |
|        | `module.vpc.aws_network_acl_rule.https_request_out_response_ingress_ephemeral[0]`        |
|        | `module.vpc.aws_route.private_nat_gateway[0]`                                            |
|        | `module.vpc.aws_route.public_internet_gateway`                                           |
|        | `module.vpc.aws_route_table.private[0]`                                                  |
|        | `module.vpc.aws_route_table.public`                                                      |
|        | `module.vpc.aws_route_table_association.private[0]`                                      |
|        | `module.vpc.aws_route_table_association.private[1]`                                      |
|        | `module.vpc.aws_route_table_association.public[0]`                                       |
|        | `module.vpc.aws_route_table_association.public[1]`                                       |
|        | `module.vpc.aws_subnet.private[0]`                                                       |
|        | `module.vpc.aws_subnet.private[1]`                                                       |
|        | `module.vpc.aws_subnet.public[0]`                                                        |
|        | `module.vpc.aws_subnet.public[1]`                                                        |
|        | `module.vpc.aws_vpc.main`                                                                |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-n8n/actions/runs/15761022850).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecs_task_ssm_parameters will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # data.aws_iam_policy_document.efs_access_point_secure will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "efs_access_point_secure" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientWrite",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowAccessThroughAccessPoint"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "elasticfilesystem:AccessPointArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]
          + sid       = "DenyNonSecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.efs_mount will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "efs_mount" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientWrite",
              + "elasticfilesystem:DescribeMountTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_acm_certificate.n8n will be created
  + resource "aws_acm_certificate" "n8n" {
      + arn                       = (known after apply)
      + domain_name               = "n8n.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.n8n.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "n8n.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.n8n.cdssandbox.xyz",
          + "n8n.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.n8n will be created
  + resource "aws_acm_certificate_validation" "n8n" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_efs_access_point.n8n will be created
  + resource "aws_efs_access_point" "n8n" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags            = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/n8n"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "775"
            }
        }
    }

  # aws_efs_backup_policy.n8n will be created
  + resource "aws_efs_backup_policy" "n8n" {
      + file_system_id = (known after apply)
      + id             = (known after apply)

      + backup_policy {
          + status = "ENABLED"
        }
    }

  # aws_efs_file_system.n8n will be created
  + resource "aws_efs_file_system" "n8n" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + throughput_mode         = "bursting"

      + protection (known after apply)
    }

  # aws_efs_file_system_policy.n8n will be created
  + resource "aws_efs_file_system_policy" "n8n" {
      + bypass_policy_lockout_safety_check = false
      + file_system_id                     = (known after apply)
      + id                                 = (known after apply)
      + policy                             = (known after apply)
    }

  # aws_efs_mount_target.n8n[0] will be created
  + resource "aws_efs_mount_target" "n8n" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # aws_efs_mount_target.n8n[1] will be created
  + resource "aws_efs_mount_target" "n8n" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # aws_lb.n8n will be created
  + resource "aws_lb" "n8n" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "n8n-staging"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                                                     = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.n8n will be created
  + resource "aws_lb_listener" "n8n" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-3-FIPS-2023-04"
      + tags                                                                  = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                                                              = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_target_group.n8n will be created
  + resource "aws_lb_target_group" "n8n" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 5678
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-399"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = true
          + type            = "lb_cookie"
        }

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_route53_record.n8n_A will be created
  + resource "aws_route53_record" "n8n_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "n8n.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z0528512WTOPE2TB0F58"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.n8n_validation["*.n8n.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "n8n_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0528512WTOPE2TB0F58"
    }

  # aws_route53_record.n8n_validation["n8n.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "n8n_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0528512WTOPE2TB0F58"
    }

  # aws_security_group.n8n_ecs will be created
  + resource "aws_security_group" "n8n_ecs" {
      + arn                    = (known after apply)
      + description            = "NSG for n8n ECS Tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "n8n_ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.n8n_efs will be created
  + resource "aws_security_group" "n8n_efs" {
      + arn                    = (known after apply)
      + description            = "Allow access to EFS from n8n ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "n8n_efs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.n8n_lb will be created
  + resource "aws_security_group" "n8n_lb" {
      + arn                    = (known after apply)
      + description            = "NSG for n8n load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "n8n_lb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.n8n_ecs_egress_all will be created
  + resource "aws_security_group_rule" "n8n_ecs_egress_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.n8n_ecs_ingress_lb will be created
  + resource "aws_security_group_rule" "n8n_ecs_ingress_lb" {
      + description              = "Ingress from load balancer to n8n ECS task"
      + from_port                = 5678
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5678
      + type                     = "ingress"
    }

  # aws_security_group_rule.n8n_efs_ingress_ecs will be created
  + resource "aws_security_group_rule" "n8n_efs_ingress_ecs" {
      + description              = "Allow NFS traffic from n8n ECS tasks"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "ingress"
    }

  # aws_security_group_rule.n8n_lb_egress_ecs will be created
  + resource "aws_security_group_rule" "n8n_lb_egress_ecs" {
      + description              = "Egress from load balancer to n8n ECS task"
      + from_port                = 5678
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5678
      + type                     = "egress"
    }

  # aws_security_group_rule.n8n_lb_ingress_internet_https will be created
  + resource "aws_security_group_rule" "n8n_lb_ingress_internet_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Ingress from internet to load balancer (HTTPS)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_ssm_parameter.n8n_encryption_key will be created
  + resource "aws_ssm_parameter" "n8n_encryption_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "n8n_encryption_key"
      + tags           = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_wafv2_rule_group.rate_limiters_group will be created
  + resource "aws_wafv2_rule_group" "rate_limiters_group" {
      + arn         = (known after apply)
      + capacity    = 64
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "RateLimitersGroup"
      + name_prefix = (known after apply)
      + scope       = "REGIONAL"
      + tags        = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }

      + rule {
          + name     = "BlanketRequestLimit"
          + priority = 1

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 2000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "BlanketRequestLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "LoginLimit"
          + priority = 3

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 10

                  + scope_down_statement {
                      + and_statement {
                          + statement {
                              + regex_match_statement {
                                  + regex_string = "^(put|post)$"

                                  + field_to_match {
                                      + method {}
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                          + statement {
                              + regex_match_statement {
                                  + regex_string = "^/rest/(login|forgot-password)$"

                                  + field_to_match {
                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "PostRequestRateLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "PostRequestLimit"
          + priority = 2

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 200

                  + scope_down_statement {
                      + regex_match_statement {
                          + regex_string = "^(put|post)$"

                          + field_to_match {
                              + method {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "PostRequestRateLimit"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
    ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
